app/Models/ClientesModel.php

SELECT `nombre`
FROM `clientes`
GROUP BY `nombre`
---
    public function getClientes(){
        $db = db_connect();
        $builder = $db->table('clientes')->select('nombre')->groupBy('nombre');
        $query = $builder->get();

INSERT INTO `clientes` (`nombre`, `telefono`, `email`, `preferencias`, `historialReservas`, `created_at`, `updated_at`) VALUES ('Andrea', 'fchcfgcfc', 'andylaloca@gmail.com', 'Comida picante', 'Reserva 20', '2024-05-17 17:18:39', '2024-05-17 17:18:39')
---
    public function insertCliente($data){
        $this->insert($data);